[["https://www.tiktok.com/@aoc/video/7356257374031596843", "We’re going to cancel student debt! 30 million Americans will be eligible to have all or some their student loans forgiven. This new plan will cancel runaway interest, provide relief for borrowers who have been paying their loans for over 20 years and for 2 million borrowers who already qualify debt forgiveness programs but are not enrolled. It will even cancel debt for borrowers facing financial hardship, and much more. Stay tuned!"], ["https://www.tiktok.com/@aoc/video/7350754905172266270", "Has there ever been a president subject to as many criminal charges, indictments, and investigations as Donald Trump?"], ["https://www.tiktok.com/@aoc/video/7349960137148271902", "“When we are talking about the famine, the actions of Hamas should not be tied to whether a 3 year-old can eat. The actions of Hamas do not justify forcing hundreds of thousands of people to eat grass.”"], ["https://www.tiktok.com/@aoc/video/7345475051480730911", "You can cut down every flower, but you can’t stop the spring 🌷"], ["https://www.tiktok.com/@aoc/video/7340349970811194654", "This January, AOC joined The Gurls Talk Podcast with Adwoa Aboah for an insightful conversation about authenticity, facing fear head-on, our impact with activism, and more."], ["https://www.tiktok.com/@aoc/video/7338553526768995615", "Five years ago, we introduced a vision for social and ecological transformation big enough to save our planet—the Green New Deal."], ["https://www.tiktok.com/@aoc/video/7280969516253728042", "STUDENT LOAN GUIDE PT 6/6: WHAT TO DO IF YOUR LOAN SERVICER IS MISHANDLING YOUR ACCOUNT"], ["https://www.tiktok.com/@aoc/video/7280968713640152362", "STUDENT LOAN GUIDE PT 5/6: WHAT HAPPENS IF I DON’T PAY AND HOW DO YOU EVEN START?"], ["https://www.tiktok.com/@aoc/video/7280967921470278958", "STUDENT LOAN GUIDE PT 4/6: ELIMINATING/REDUCING YOUR STUDENT LOAN PAYMENT WITH THE NEW SAVE PROGRAM"], ["https://www.tiktok.com/@aoc/video/7280966794750414126", "STUDENT LOAN GUIDE PART 3/6: YOU COULD BE ELIGIBLE FOR LOAN CANCELLATION *NOW* AND NOT KNOW IT"], ["https://www.tiktok.com/@aoc/video/7280962858626616619", "STUDENT LOAN GUIDE PART 2/6: HOW DID WE GET HERE?"], ["https://www.tiktok.com/@aoc/video/7280961581289114922", "STUDENT LOAN GUIDE PART 1 of 6: INTRODUCTION"]]