[["https://www.tiktok.com/@repsummerlee/video/7348925007977925919", ""], ["https://www.tiktok.com/@repsummerlee/video/7348568057402412319", ""], ["https://www.tiktok.com/@repsummerlee/video/7348138545019620638", ""], ["https://www.tiktok.com/@repsummerlee/video/7343765829449764127", ""], ["https://www.tiktok.com/@repsummerlee/video/7341086682222972191", ""], ["https://www.tiktok.com/@repsummerlee/video/7335919441781361966", ""], ["https://www.tiktok.com/@repsummerlee/video/7332179936498797867", ""], ["https://www.tiktok.com/@repsummerlee/video/7331010748539505966", ""], ["https://www.tiktok.com/@repsummerlee/video/7330303894280621358", ""], ["https://www.tiktok.com/@repsummerlee/video/7309949488641314094", "The contributions of Henrietta Lacks, Katherine Johnson, and countless more Black folks demonstrate that meaningful representation must be prioritized in the scientific field's unbiased pursuit of the truth."], ["https://www.tiktok.com/@repsummerlee/video/7302076189508734251", "“I witnessed the havoc US bullets and bombs waged on the people [of Iraq] (...) these are the actions being perpetrated now against the people of Gaza--against innocent civilians and children\""], ["https://www.tiktok.com/@repsummerlee/video/7284355376126987551", "I made Marjorie MAD when pointing out how many workers in her district will go without their paychecks during the shutdown."], ["https://www.tiktok.com/@repsummerlee/video/7284004297027702062", "In MTG's district, Republican’s shutdown will cost 6,306 folks their paychecks."], ["https://www.tiktok.com/@repsummerlee/video/7283650871488040235", "Speaker McCarthy has proven he’s in over his head—he’d rather shutdown the government to keep his job than do the bare minimum to keep it running."], ["https://www.tiktok.com/@repsummerlee/photo/7282861574421892395", ""], ["https://www.tiktok.com/@repsummerlee/video/7281472604320304426", "Earth Wind and Repubicans are setting the Govt on Fire. 🤡🔥"], ["https://www.tiktok.com/@repsummerlee/video/7281453732175416618", "Earth Wind & Repubicans are setting the govt on Fire. 🤡🔥"], ["https://www.tiktok.com/@repsummerlee/video/7281358905530223914", "McCarthy and his goons are forcing a government shutdown because they know that WE THE PEOPLE won’t stand for their cruel plot to please their culture-warriors and bankroll their billionaire friends."], ["https://www.tiktok.com/@repsummerlee/video/7280211669760970027", "I already told y’all how right-wing sugar-daddies bought SCOTUS Justices Thomas and Alito to end affirmative action + student debt relief."], ["https://www.tiktok.com/@repsummerlee/video/7279044048025849134", "Pay your workers what you owe them, don't act like you forgot."], ["https://www.tiktok.com/@repsummerlee/video/7279040920668998958", "@GOP Oversight had the audacity to hold a hearing defending CEOs who caused Black women ovarian cancer."], ["https://www.tiktok.com/@repsummerlee/video/7261403603695570222", "Caught up with @elise from"], ["https://www.tiktok.com/@repsummerlee/video/7260924462911212846", "Not to sound like a radio hit on repeat, but some of the worst air quality in the country is found in my district. It means a lot to me that I sit in this seat to affect change to my community & legislation like this is one step in the right direction towards cleaner air in PA."], ["https://www.tiktok.com/@repsummerlee/video/7260587227439467822", "Addiction is a health crisis & a brain disease that we must treat with the same urgency as any other ailment."], ["https://www.tiktok.com/@repsummerlee/video/7259426102144224555", "Tatum Brown, our art competition winner recently stopped by to pay us a visit and take a look at her art work that is posted for all U.S. Capitol visitors to see. Tatum did a beautiful piece that recognizes coal miners in our district. She will be headed to the Savannah School of Art & Design in the Fall to peruse her art degree! Way to go, Tatum!"], ["https://www.tiktok.com/@repsummerlee/video/7258315390663544106", "Republican efforts to use the term \"two-tiered justice\" only aims to divert attention from the true victims of disparate treatment within our criminal justice system."], ["https://www.tiktok.com/@repsummerlee/video/7257882681814322478", "Enough of Rs weaponizing the term \"two-tiered justice\" to help Trump & his cronies play victim by erasing those who are truly victims of disparate treatment."], ["https://www.tiktok.com/@repsummerlee/video/7257613961577925934", "There is NOTHING \"radical\" about organizing for our own survival."], ["https://www.tiktok.com/@repsummerlee/video/7257544814634290478", "We know that Republicans have never cared about the lives of babies or children or they wouldn't be cutting access to health care & childcare and they wouldn't be ignoring the Black maternal mortality crisis."], ["https://www.tiktok.com/@repsummerlee/video/7256920299688643886", "Pittsburgh is a union town & we will stand for workers not only in our city, but all over this country."], ["https://www.tiktok.com/@repsummerlee/video/7255421673766292782", "….$41.6 million on viagra? $2.3 million on king crab?"], ["https://www.tiktok.com/@repsummerlee/video/7247623563178691886", "Yesterday, I joined my brother"], ["https://www.tiktok.com/@repsummerlee/video/7246903731118148907", "When I first came to Congress, we got a tour of the Capitol. As a lover of art and museums, I spent time analyzing the art and I noticed just how problematic some of the art is. Some of the art that has been on display for millions to come see is rooted in racism and doesn’t depict accurate representations of history. So come along with me as we discuss some of this art and it’s “problems”."], ["https://www.tiktok.com/@repsummerlee/video/7244929682943167790", "Republicans show you time & time again that they will always choose those big, bountiful checks from the gun lobby over the lives of the American people."], ["https://www.tiktok.com/@repsummerlee/video/7242692881356426542", "Meet our office dog, Feranmi."], ["https://www.tiktok.com/@repsummerlee/video/7242024859843185963", "Instead of doing anything about the smoke filled air, Republicans are holding anti-climate hearings that they don’t even show up to. BFFR."], ["https://www.tiktok.com/@repsummerlee/video/7237595748034956587", "Glance at a week in the life of a member of Congress"], ["https://www.tiktok.com/@repsummerlee/video/7236825522565647658", "Crushing student debt is suffocating millions, hindering our ability to start lives, buy homes, save for retirement & build generational wealth."], ["https://www.tiktok.com/@repsummerlee/video/7236746901863796010", "We all agree that prescription drug prices are out of control. Yet we seem to be the only country suffering from this problem."], ["https://www.tiktok.com/@repsummerlee/video/7236121500057685290", "POV: Me when they realize they let a working-class Black woman with hundreds of thousands of dollars in student debt into Congress."], ["https://www.tiktok.com/@repsummerlee/video/7236039503901642026", "This is about families having food taken away. This is about students not being able to go to school. This is about veterans not getting the treatment they need & this is about kids & seniors having health care stripped away."], ["https://www.tiktok.com/@repsummerlee/video/7235262344769621291", "This has NEVER been about the budget for Republicans."], ["https://www.tiktok.com/@repsummerlee/video/7234647496289701166", "Imagine taking food or medicaid away from a family in need so your rich donor has money to buy another yacht."], ["https://www.tiktok.com/@repsummerlee/video/7234236893611805995", "In the wealthiest nation on earth, NO ONE should be without health care. Period."], ["https://www.tiktok.com/@repsummerlee/video/7233854794161458475", "D.C. pays more per capita federal taxes than any state, including Kentucky, yet they are denied full voting representation in Congress."], ["https://www.tiktok.com/@repsummerlee/video/7231987876085452074", "Day in the life of a member of Congress:"], ["https://www.tiktok.com/@repsummerlee/video/7230836220102823211", "Republicans want to control what books you read & what history you learn."], ["https://www.tiktok.com/@repsummerlee/video/7227186827747233067", "Enjoyed spending time with my brother,"], ["https://www.tiktok.com/@repsummerlee/video/7227157651568823594", "Does #georgesantos come up with anything on his own?"], ["https://www.tiktok.com/@repsummerlee/video/7227133416356105518", "Republicans are trying to silence ALL our voices. Young voices, Black & brown voices, working class voices, marginalized voices."], ["https://www.tiktok.com/@repsummerlee/video/7226838827837558058", "It's a shame that 100 years after the Equal Rights Amendment was first introduced, we are still fighting for gender equality in our Constitution."], ["https://www.tiktok.com/@repsummerlee/video/7226793691812220203", "I stood alongside my brothers"], ["https://www.tiktok.com/@repsummerlee/video/7226374163689327918", "Sat down with Rep. Balint for a candid conversation about what it’s like to work in this republican majority 🤡"], ["https://www.tiktok.com/@repsummerlee/video/7226090544584232235", "Behind the scenes of the @ellemagazine"], ["https://www.tiktok.com/@repsummerlee/video/7224666629328719150", "The Green New Deal movement is powerful because it’s intersectional: climate justice, racial justice, health justice, economic justice, social justice, and health justice. Now we’ve got to get to the finish line."], ["https://www.tiktok.com/@repsummerlee/video/7223851341200870702", "We did it, Joanna! So good to have you in D.C.!"], ["https://www.tiktok.com/@repsummerlee/video/7223505109471268142", "My first 100 days in Congress in 1 minute."]]