[["https://www.tiktok.com/@bernie/video/7359628313263901995", ""], ["https://www.tiktok.com/@bernie/video/7358909058545601838", ""], ["https://www.tiktok.com/@bernie/video/7355598713294818602", ""], ["https://www.tiktok.com/@bernie/video/7355598585305582891", ""], ["https://www.tiktok.com/@bernie/video/7351467005943450926", ""], ["https://www.tiktok.com/@bernie/video/7276090975934516526", "Democrats must reject austerity and end billionaire control over our economic and our political life."], ["https://www.tiktok.com/@bernie/video/7274681746455612714", "What Democrats have got to do is have the guts to take on corporate greed."], ["https://www.tiktok.com/@bernie/video/7273911979461332266", "The Democrats, once and for all, must reject the corporate wing of the party and empower those who are prepared to create a grassroots, multi-racial, multi-generational working class party in every state in this country."], ["https://www.tiktok.com/@bernie/video/7273885303402728746", "Working class Americans are looking around and asking “who cares about us?” We have got to make it clear that Democrats stand with them and that we are prepared to take on the unprecedented corporate greed that is happening right now."], ["https://www.tiktok.com/@bernie/video/7258314195677089066", ""], ["https://www.tiktok.com/@bernie/video/7256449029934976298", "This week, I was joined by Rep. Alexandria Ocasio-Cortez, Sen. Sheldon Whitehouse, David Wallace-Wells, and Bill McKibben for an important discussion about climate change and where we go from here."], ["https://www.tiktok.com/@bernie/video/7255440163609021742", "My state has just suffered its worst natural disaster since 1927. The climate crisis is here. For the sake of our common humanity, we must act boldly."], ["https://www.tiktok.com/@bernie/video/7249106207070342442", "REI executives say they focus on shared values, not share value. Yet they continue to intimidate and retaliate against pro-union workers. I stand in solidarity with workers and urge REI to stop illegally union-busting."], ["https://www.tiktok.com/@bernie/video/7247348881061711147", "If UPS can spend over $8.4 billion on stock buybacks and dividends this year, it can afford to provide better wages, benefits, and working conditions to its employees."], ["https://www.tiktok.com/@bernie/video/7244712596572523822", "Shock of shocks! An oil and gas lobbyist thinks Americans breathing in smoke from wildfires, which are a direct result of climate change, is no big deal. WRONG. We must take on Big Oil’s greed and fundamentally transform our energy system away from fossil fuels."], ["https://www.tiktok.com/@bernie/video/7242827556569894190", "The wealthy and the powerful want to keep us divided up so they can laugh all the way to the bank. Now, more than ever, we must stand together."], ["https://www.tiktok.com/@bernie/video/7239517419046210862", "I will be voting no on the debt limit deal because you do not do deficit reduction on the backs of Americans who are already struggling."], ["https://www.tiktok.com/@bernie/video/7236917694069738798", "As everybody knows, we are dealing with a national mental health crisis. What I've heard from workers across the country is that coming together and fighting for higher wages and better benefits has helped them combat the isolation that so many of us are feeling."], ["https://www.tiktok.com/@bernie/video/7236488525577932078", "While Republicans say they are \"deeply concerned\" about the national debt, they support:"], ["https://www.tiktok.com/@bernie/video/7233066069735394603", "At a time of massive and growing income and wealth inequality and record-breaking corporate profits, we must stand up for working people who are struggling every day to provide a minimal standard of living for their families and raise the minimum wage to $17 an hour."], ["https://www.tiktok.com/@bernie/video/7232398107709852971", "Let’s make Helen Gym the next mayor of Philadelphia."], ["https://www.tiktok.com/@bernie/video/7231739160451894574", "Graduate student workers around the country are standing up and fighting for economic justice."], ["https://www.tiktok.com/@bernie/video/7229856364548427051", ""], ["https://www.tiktok.com/@bernie/video/7228199997043526955", ""], ["https://www.tiktok.com/@bernie/video/7227697782088322346", "It is imperative that we make sure that new technology like artificial intelligence works for us, and not just a few billionaires who already control everything else about our economy."], ["https://www.tiktok.com/@bernie/video/7227568307254119723", ""], ["https://www.tiktok.com/@bernie/video/7223057816561421614", ""], ["https://www.tiktok.com/@bernie/video/7221327853818891562", "I’m proud to stand in solidarity with striking workers at Rutgers University."], ["https://www.tiktok.com/@bernie/video/7219419366754929963", "Let me be very clear. We do not have a 'labor shortage' in this country. What we have is a working class who are saying they aren't going to work longer hours for lower wages in unsafe conditions while corporations make record profits."], ["https://www.tiktok.com/@bernie/video/7218580701644442922", "How do we create more stability and job security for working class people all across the country? Raise the minimum wage. Strengthen and grow the trade union movement. Invest in our young people. That's how we make sure every person in this country earns a living wage."], ["https://www.tiktok.com/@bernie/video/7218153533609233706", "Today, if we see large numbers of working people all across the city of Chicago turn out and vote Brandon Johnson for Mayor of Chicago, we can finally begin to create a government which invests in the needs of its people."], ["https://www.tiktok.com/@bernie/video/7217995088964734251", "Here's what happens with the American people: They work longer hours, their standard of living is in decline, and they turn on their television, but they do not see a reflection of that reality in the news media."], ["https://www.tiktok.com/@bernie/video/7216859067749338410", "What Brandon Johnson is doing in his campaign for mayor and what I am trying to do back in Washington is something that we have got to do all over this country, and that is to build a government that works for all of us, not just the wealthy few."], ["https://www.tiktok.com/@bernie/video/7216722658212187438", "I happen to believe that billionaires who wage illegal union busting campaigns are not above the law."], ["https://www.tiktok.com/@bernie/video/7216429730453835054", "You don't have to work for nothing. You have a right to dignity."], ["https://www.tiktok.com/@bernie/video/7215406222814711086", "Turn on your TV, there's the pharmaceutical industry telling you how deeply concerned they are about your problems. If they're so \"deeply concerned\" about your problems, why is it that they charge you 10x more for prescription drugs than in Canada?"], ["https://www.tiktok.com/@bernie/video/7215292503061204270", "The question we should be asking is not which programs we cut — it should be why aren't we living in a society in which all of our people have a decent standard of living? Is that a Utopian vision? It really is not."], ["https://www.tiktok.com/@bernie/video/7212066113700629806", "Have we learned anything from the Savings and Loan disaster of the early 1990s? For too many in Washington, the answer is a resounding NO."], ["https://www.tiktok.com/@bernie/video/7211494278030314798", "It is a bleak irony that the very same regulations which would have prevented the need for a bailout at Silicon Valley Bank were lobbied against in Washington by its CEO, Gregory Becker back in 2018."], ["https://www.tiktok.com/@bernie/video/7210955811722448171", "In my view, if Disney can afford to compensate its CEO to the tune of $27 million, it should not be paying the workers who run their theme parks so little that they are sleeping in their cars, relying on food banks, and unable to afford to get the health care they need."], ["https://www.tiktok.com/@bernie/video/7210419055021296939", "While I am sorry that I cannot be there to help @latenightseth make better decisions, I can say that it is always a bad idea to trust Wall Street and the big banks to write their own rules and regulations."], ["https://www.tiktok.com/@bernie/video/7210202092710006059", "If you've got $5 billion, do you really need to step on people in order to get ANOTHER $5 billion? When is 'enough' going to be enough for these guys?"], ["https://www.tiktok.com/@bernie/video/7208376573697805611", "The oligarchs and the corporate class of this country are waging class war against working Americans. The working class needs a party that's going to fight back — and win."], ["https://www.tiktok.com/@bernie/video/7208228850294148394", "It is not a radical idea to say that pursuing an education in this country should not mean that you are penalized with decades of crushing debt."], ["https://www.tiktok.com/@bernie/video/7206855781872831786", "You work hard, start a business, make some money, fine, become rich! But do you really need $50 or $100 BILLION? That is more money than you could spend in one lifetime. Should the wealthy in this country finally begin to pay their fair share? You're damn right."], ["https://www.tiktok.com/@bernie/video/7206485809611132206", "When we talk about divisions in this country, we're not talking about Republicans versus Democrats. It is the billionaire class versus everybody else."], ["https://www.tiktok.com/@bernie/video/7205775062732148014", "In 2019, I traveled by bus up to Canada with a group of diabetics to purchase insulin for a fraction of what they were paying here in the United States. Today, Eli Lily has significantly lowered its insulin price to $35 a month. Grassroots pressure works. Let's keep going."], ["https://www.tiktok.com/@bernie/video/7203509991167249707", "Here's the crazy situation. Somebody making $10 million in a year is contributing the EXACT SAME AMOUNT into Social Security as somebody making $160,000. Let's raise the cap and expand Social Security benefits, not cut them."], ["https://www.tiktok.com/@bernie/video/7203464084849823022", "Let's be clear. While the middle class continues to decline and the working class continues to barely scrape by, the system we have in place today is working extraordinarily well for those who own it. These oligarchs have enormous wealth. They have enormous power. For those at the top, things have never in the history of this country been better. They have mansions all across the globe, their private islands, their yachts, their private jets, and for some, they've got their spaceships that they use to zoom around up in outer space. Gee whiz, isn't that neat! Well, back here on Earth, make no mistake about it — there is a class war being waged by the wealthy elite on the working class of this country. Well, if there's going to be class warfare, it is the working class who must win that war. To do that, we must stand together in solidarity, rebuild the trade union movement, and fight back without apology."], ["https://www.tiktok.com/@bernie/video/7203153785940741422", "How is it that YouTube Music rakes in $6 BILLION in revenue in a given year, but pays its workers so poorly that they can't afford gas for their cars or a roof over their heads? It's GREED."], ["https://www.tiktok.com/@bernie/video/7203074797272730926", "I'm going to tell you something you won't hear about too much in the mainstream media. We have a corrupt political system in which billionaires through super PACs can buy elections in this country."], ["https://www.tiktok.com/@bernie/video/7202781811234180394", "The word is that drug company CEOs are a little NERVOUS about Chairman Bernie Sanders holding them accountable for their reckless greed. Should they be worried?"], ["https://www.tiktok.com/@bernie/video/7200946058417999150", "Graduate students at Temple University have faced retaliation for going on strike and asserting the radical notion that they should make a living wage, receive decent benefits, and get dignity on the job. I stand in strong solidarity with the workers of Temple University Graduate Students' Association."], ["https://www.tiktok.com/@bernie/video/7197587353765088558", "As Americans die because they can't afford the medications they need, 5 of the largest drug companies in the U.S. made nearly $80 billion in profits last year alone."], ["https://www.tiktok.com/@bernie/video/7196885665051757870", "No. Billionaires across the globe cannot continue to take in more and more while the working class in country after country are expected to get by on less and less."], ["https://www.tiktok.com/@bernie/video/7196040495561248043", "Today, while more and more working class Americans are unable to afford the health care they need, 3 people own more wealth than the bottom half of American society — 165 million people."], ["https://www.tiktok.com/@bernie/video/7192419757180685610", "New York State Nurses Association nurses demanded change, and now, change is happening. CONGRATULATIONS to nurses at Mount Sinai Hospital & Montefiore Medical Center on your hard fought victory."], ["https://www.tiktok.com/@bernie/video/7192230177898777902", "Student debt is an incredible burden on millions and millions of young people who did nothing wrong except try to get the education they need. Yes, we can cancel all student debt in this country."], ["https://www.tiktok.com/@bernie/video/7191620503109455146", "At a time when half of older Americans have no retirement savings & 55% of seniors are trying to survive on less than $25,000 a year, our job is not to cut Social Security or raise taxes on workers. Our job is to expand it so all seniors can live with the dignity they deserve."], ["https://www.tiktok.com/@bernie/video/7190013744087436586", "How does it happen that, despite spending almost twice per capita on health care as the people of other industrialized nations, our life expectancy is LOWER and getting worse?"], ["https://www.tiktok.com/@bernie/video/7188913202757897515", "Given the parameters of what we understand as basic, comprehensive health care today, in my strong opinion, we are spending more than enough money to guarantee quality health care to all of our people."], ["https://www.tiktok.com/@bernie/video/7188323364023520558", ""], ["https://www.tiktok.com/@bernie/video/7187523134449388846", ""], ["https://www.tiktok.com/@bernie/video/7186814990509247790", "We should ask ourselves about the priorities of this country when year after year, we continue to spend billions of dollars on corporate welfare while 60% of our people live paycheck to paycheck."], ["https://www.tiktok.com/@bernie/video/7184937211907935530", ""], ["https://www.tiktok.com/@bernie/video/7167168694194326830", ""], ["https://www.tiktok.com/@bernie/video/7166403973220404526", ""], ["https://www.tiktok.com/@bernie/video/7164624536950918443", ""], ["https://www.tiktok.com/@bernie/video/7164218245736828206", ""], ["https://www.tiktok.com/@bernie/video/7164118101141884206", ""], ["https://www.tiktok.com/@bernie/video/7163398000335670570", ""], ["https://www.tiktok.com/@bernie/video/7163318587770457390", ""], ["https://www.tiktok.com/@bernie/video/7163028493566233902", ""], ["https://www.tiktok.com/@bernie/video/7162540756953992491", ""], ["https://www.tiktok.com/@bernie/video/7162269798259379498", ""], ["https://www.tiktok.com/@bernie/video/7161851346897947946", ""], ["https://www.tiktok.com/@bernie/video/7161218303136910635", ""], ["https://www.tiktok.com/@bernie/video/7160712023389588782", ""], ["https://www.tiktok.com/@bernie/video/7160321014524775726", ""], ["https://www.tiktok.com/@bernie/video/7159994295469100330", ""], ["https://www.tiktok.com/@bernie/video/7159711886370540842", ""], ["https://www.tiktok.com/@bernie/video/7159598317637307694", ""], ["https://www.tiktok.com/@bernie/video/7159363590481399082", ""], ["https://www.tiktok.com/@bernie/video/7159020144117763370", ""], ["https://www.tiktok.com/@bernie/video/7158253853396389166", ""], ["https://www.tiktok.com/@bernie/video/7157865412607331630", ""], ["https://www.tiktok.com/@bernie/video/7157029079470918955", ""], ["https://www.tiktok.com/@bernie/video/7156780189106801966", ""], ["https://www.tiktok.com/@bernie/video/7155671345265790254", ""], ["https://www.tiktok.com/@bernie/video/7155552816415870254", ""], ["https://www.tiktok.com/@bernie/video/7155165933298928942", ""], ["https://www.tiktok.com/@bernie/video/7153665666967506219", ""], ["https://www.tiktok.com/@bernie/video/7152309445421419822", ""], ["https://www.tiktok.com/@bernie/video/7151794159500692778", ""], ["https://www.tiktok.com/@bernie/video/7150099970899643691", ""], ["https://www.tiktok.com/@bernie/video/7149295716861562154", ""], ["https://www.tiktok.com/@bernie/video/7145847703036038443", ""], ["https://www.tiktok.com/@bernie/video/7145101071881440555", ""], ["https://www.tiktok.com/@bernie/video/7143761647419526446", ""], ["https://www.tiktok.com/@bernie/video/7142275074173832490", ""], ["https://www.tiktok.com/@bernie/video/7141118267342490922", ""], ["https://www.tiktok.com/@bernie/video/7140743399170395438", ""], ["https://www.tiktok.com/@bernie/video/7139606292083068206", ""], ["https://www.tiktok.com/@bernie/video/7137473331355225390", ""], ["https://www.tiktok.com/@bernie/video/7137376839584173358", ""], ["https://www.tiktok.com/@bernie/video/7136605448031178030", ""], ["https://www.tiktok.com/@bernie/video/7135530312376880430", ""], ["https://www.tiktok.com/@bernie/video/7135108553114668331", ""], ["https://www.tiktok.com/@bernie/video/7130668416570101038", "In the real world, our people are hurting. We pay the highest prices in the world for health care. 18 million families spend 50% of their limited incomes on housing. People cannot afford childcare or pre-K. We need an agenda that keeps the focus on those issues."], ["https://www.tiktok.com/@bernie/video/7129657166323256622", "Money for child care for working class kids? \"Can't afford it!\""], ["https://www.tiktok.com/@bernie/video/7127281281548881198", "Today's election in Michigan is important — not only to re-elect Rashida Tlaib and Andy Levin, but for the people of Michigan to tell these billionaires and their corporate PACs that no, they cannot buy our democracy."], ["https://www.tiktok.com/@bernie/video/7125808716779130154", "What the historic union organizing efforts are all about — and what our movement is about — is whether or not we are going to have an economy that works for all, and not just the wealthy few."], ["https://www.tiktok.com/@bernie/video/7123644300839128366", "I want you all to know that we are looking at a situation in this country where a relatively small number of corporations control what we see, hear, and read."], ["https://www.tiktok.com/@bernie/video/7122974229347175726", "We can't give in to doomerism."], ["https://www.tiktok.com/@bernie/video/7122245564183498027", "What we are seeing now are massive heatwaves. Thousands of people are dying. We're seeing more drought. We're seeing more extreme weather disturbances. Given that reality, it is literally incomprehensible that we have a Congress which is incapable of acting."], ["https://www.tiktok.com/@bernie/video/7121373821319367982", "Joe Manchin has taken campaign money from 25 Republican billionaires. I do not think he is interested in representing the needs of working families."], ["https://www.tiktok.com/@bernie/video/7121004190087875886", "Solidarity says that in what is a very difficult world, you are not alone. You have the union. I think that is very profound."], ["https://www.tiktok.com/@bernie/video/7119878807716154667", "This is how corrupt and criminal the system is."], ["https://www.tiktok.com/@bernie/video/7119286054515019054", "CEOs today make 350x more than what their workers do. How absurd is that? It’s time to tell corporate America to stop the greed."], ["https://www.tiktok.com/@bernie/video/7116931046385388846", "Medicare for All would have saved thousands of lives during the pandemic."], ["https://www.tiktok.com/@bernie/video/7115460939423436078", "The airline industry got $50 billion in taxpayer money in its time of need. What did Americans get in return? Disruptions, delays, and cancellations."], ["https://www.tiktok.com/@bernie/video/7110658678511963435", "The good news is this: the American people are prepared to stand up and fight back against rampant corporate greeed."], ["https://www.tiktok.com/@bernie/video/7110197236356762926", "Last night, over 1,100 working class people joined us to say that the time is now to join together in solidarity, to stand up, and to fight back. THANK YOU CHICAGO!"], ["https://www.tiktok.com/@bernie/video/7109655888318713134", "When people like Sen. Lindsey Graham speak, you don't hear anything about the major issues facing the country. That's what the political establishment does."], ["https://www.tiktok.com/@bernie/video/7109159571536727342", "I've got a message for Fox News viewers."], ["https://www.tiktok.com/@bernie/video/7108796961641319723", "We desperately need Amy Vilela in the Congress fighting for Medicare for All."], ["https://www.tiktok.com/@bernie/video/7107624538417941803", "Workers at CNH Manufacturing are being offered sub-par wages and health care with sky-high deductibles. Totally unacceptable."], ["https://www.tiktok.com/@bernie/video/7104716585709030702", "The Walton Family of Walmart got $40.7 BILLION richer during the pandemic. Please don't tell me Walmart cannot afford to give workers paid sick leave."], ["https://www.tiktok.com/@bernie/video/7103942815155260718", "Americans are demanding REAL gun safety reform."], ["https://www.tiktok.com/@bernie/video/7101306891623484715", "I have traveled all over this country. I've never met anyone who loves paying more than 2x as much for health care as people in other major countries."], ["https://www.tiktok.com/@bernie/video/7100355053805931818", "You cannot tell me with a straight face that CEOs in this country are working 351x harder than their workers. It's GREED, plain and simple."], ["https://www.tiktok.com/@bernie/video/7099564976804957486", "I'm headed to Texas to do all that I can do to make sure Jessica Cisneros becomes the next congressperson for the 28th district of Texas."], ["https://www.tiktok.com/@bernie/video/7099479866650692910", "As a worker, you deserve to be treated with dignity and respect."], ["https://www.tiktok.com/@bernie/video/7098720365655952682", "We desperately need strong, young, progressive voices in the Congress, and that's exactly what Nida Allam will be."], ["https://www.tiktok.com/@bernie/video/7098431494972116270", "We must tell the billionaire class, who are getting richer and richer, and enormous corporations, whose profits are soaring: You can't have it all."], ["https://www.tiktok.com/@bernie/video/7098345034315025707", "Cancel student debt. All of it."], ["https://www.tiktok.com/@bernie/video/7096564111898791214", "In the year 2022, the government should not be saying to women that they cannot have the choice about what they can do with their own bodies."], ["https://www.tiktok.com/@bernie/video/7094777159902072110", "If you spend time with the courageous workers, it is absolutely clear why the movement to unionize Starbucks stores is spreading like wildfire."], ["https://www.tiktok.com/@bernie/video/7092060476145782059", "The reality in 🇳🇴:- Health care is a right- College is tuition-free- Guaranteed 28 days of paid vacation- One year of fully paid parental leave"], ["https://www.tiktok.com/@bernie/video/7091440727036644654", "Mr. Bezos, I ask you sincerely: How much money do you need? When is 'enough' enough?"]]