[["https://www.tiktok.com/@kevinmullinforcongress/video/7080671698915314990", "I am so honored to have the endorsement of Jackie Speier for my race for Congress. @RepSpeier ‘s endorsement in"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7099197655036775723", "For 10 years, I’ve been delivering results to Peninsula voters on democracy reform, affordable housing & climate change. Representative Speier endorsed my candidacy for Congress because she knows I’ll show up to DC on day one ready to deliver for"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7077772674998553902", "⬇️comment below why you’re supporting our"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7162694166953250094", "A message from Team Kevvy Kev: it’s time to VOTE!"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7161163734050934062", "As a co-author of the legislation that puts Prop 1 on the ballot, you can count on me to protect reproductive freedoms federally in Congress."], ["https://www.tiktok.com/@kevinmullinforcongress/video/7160021535460445486", "With only 10 days until #ElectionDay"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7159349192316734766", "A key role for any Congressmember is delivering tax dollars back to their district. These resources improve constituents’ daily lives. For the last 10 years I’ve been delivering for my Assembly District. If elected to Congress, I’ll continue delivering for my district."], ["https://www.tiktok.com/@kevinmullinforcongress/video/7158246751634246954", "Thank you to all of the college students who came out to phone bank for team Mullin. Students from across the country are joining our movement because of my long history of fighting for"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7157509728073944363", "Another great day canvassing in"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7157103622243765550", "All eligible voters have 17 more days to cast their ballots. Voting is a crucial part of democracy, and now more than ever, it is essential that we all"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7156335715108965678", ""], ["https://www.tiktok.com/@kevinmullinforcongress/video/7156013063957761322", "#CA15 #democracy #fostercity"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7154126704972418350", "#SanMateoCounty was a pioneer in proving the efficacy of vote-by-mail which increased voter participation locally. In the CA Legislature I fought for all-vote-by-mail elections because accessibility to the ballot box is a right that all Californians deserve"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7153747336571702570", ""], ["https://www.tiktok.com/@kevinmullinforcongress/video/7153073155802778926", "Team Mullin had a wonderful fundraiser last week! Seeing the CD-15 community come together to support me means the world. Thank you Congresswoman Jackie Speier and former CD-15 candidate and Burlingame Councilwoman Emily Beach for joining us. Join the"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7151892504957291818", "The best way to spend a Saturday is with San Carlos democratic champions Adam Rak and Sarah Kinahan! San Carlos is an extremely important part of"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7150473190576246062", "Extreme weather is becoming more common as climate change worsens. San Mateo County is on the front lines with $24B at risk from sea level rise. California is leading with $54B of climate funding in the state budget. If elected to Congress I’ll continue this fight."], ["https://www.tiktok.com/@kevinmullinforcongress/video/7149252860599995691", "Follow along one of our amazing members of"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7148245763099888942", ""], ["https://www.tiktok.com/@kevinmullinforcongress/video/7146426153153170730", "#ca15 #democracy #kevinmullinforcongress"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7145528520859602218", "California is leading the nation when it comes to voting rights & ballot access. While automatic voter registration & universal vote by mail have increased access to voting for millions, there is still much more to be done to protect democracy."], ["https://www.tiktok.com/@kevinmullinforcongress/video/7106152532594085166", "Great weekend at the San Mateo County fair! Also a great reminder that with the primary election TOMORROW, only 17% of ballots have been returned. Ballots must be postmarked by June 7th (tomorrow) or you can find your nearest polling location at: www.sos.ca.gov/elections/polling-place"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7103922845708766506", "I’ve dedicated most of my professional life to public service because I believe that government should exist to enrich communities & support the values of its constituents. @RepSpeier has made us proud in DC. You can trust that I will carry on her legacy of effectiveness."], ["https://www.tiktok.com/@kevinmullinforcongress/video/7099650150133550379", "I didn’t always think I’d be a candidate for Congress, but I’m so grateful that I’m running to succeed my mentor Jackie Speier. If you want to help me get elected, click the link in my bio and sign up for a volunteer shift before the June 7th Primary"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7099175208204078382", "#mullinminute Accessibility to the ballot box must be expanded for all Americans. I fought for CA’s all vote by mail elections. If elected to Congress, I’ll fight to protect voting rights nationwide."], ["https://www.tiktok.com/@kevinmullinforcongress/video/7081263795317820718", "Increasing access to childcare for Californians is personal for me. We know that these programs create economic opportunities for families, but we need increased partnerships between state and federal government. In Congress, this will be a top priority of mine.#Mulli"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7080697241278696747", "And that’s when they found"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7079952980912377130", "Request a sign at kevinmullinforcongress.com!"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7077776162705100078", "We love a grassroots movement! Join our hardworking team by signing up at www.kevinmullinforcongress.com"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7077775242264857898", "☘️A St. Patrick’s Day message from our future congressman!☘️"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7077774732388535598", "Time to bring the peninsula’s success with these issues to Washington, D.C. folks!!"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7077768762820152619", "Now this is what community looks like!"], ["https://www.tiktok.com/@kevinmullinforcongress/video/7077747016566295854", "We love our San Mateo supporters! Here’s some highlights from our Downtown San Mateo merchant walk"]]