[["https://www.tiktok.com/@repmaxwellfrost/video/7203144695659416878", "Last week, at my ceremonial swearing in, we all gathered in community. Together, we pledge to be civically engaged to fight for a better world, to see joy as a part of our struggle, to fight for equity, to see humanity in all, to not shame apathy & instead inspire hope, to care for our neighbor like family; most importantly, to ALWAYS LEAD WITH LOVE!! 🫶🏾"], ["https://www.tiktok.com/@repmaxwellfrost/video/7359600432097824043", ""], ["https://www.tiktok.com/@repmaxwellfrost/video/7345566990171458862", ""], ["https://www.tiktok.com/@repmaxwellfrost/video/7343761123986165035", ""], ["https://www.tiktok.com/@repmaxwellfrost/video/7322637392370879786", "Hunter Biden is willing to testify PUBLICLY in front of the Republican-led Oversight Committee, yet they just voted to recommend that the House holds him in contempt."], ["https://www.tiktok.com/@repmaxwellfrost/video/7299270121313357099", "I'm used to debating stale gun lobby lies, but disparaging gun violence survivors on the House floor is a new low. (Also, is \"criminal-on-criminal\" House Republicans' new term for \"Black-on-Black crime\"? 🤨)"], ["https://www.tiktok.com/@repmaxwellfrost/video/7293935239972343082", "House Rs are trying to elect extremist Mike Johnson, who has less name recognition than their previous failed candidates for Speaker, in hopes that YOU will ignore that he is a walking red flag."], ["https://www.tiktok.com/@repmaxwellfrost/video/7286497332978404650", "Bithlo is a small, rural community in my district, often forgotten by those who can help. We’ll be hosting the Regional EPA Administrator to visit Bithlo to ensure that federal resources reach underserved communities. All of us deserve access to safe and clean resources."], ["https://www.tiktok.com/@repmaxwellfrost/video/7284030200114056494", "9 months in the making and this sham impeachment inquiry has started… let’s get into what’s really going on:"], ["https://www.tiktok.com/@repmaxwellfrost/video/7281774147917729067", "We marched, organized, I introduced my first bill to establish an Office of Gun Violence Prevention, and POTUS just turned our calls to action into reality. Promises kept."], ["https://www.tiktok.com/@repmaxwellfrost/video/7278744379836173614", "America: 15 days from now, when our country comes to a halt, remember who did this to you--"], ["https://www.tiktok.com/@repmaxwellfrost/video/7278440934197497118", "The Oversight Committee is supposed to be doing serious work, but the Republicans in charge only want to do oversight of Washington, D.C., false accusations into the President, & Hunter Biden's d-pic."], ["https://www.tiktok.com/@repmaxwellfrost/video/7276466021404298527", "We're coming to you live from the Mobile Launcher for Artemis 2. 🚀 It will be the first crewed mission beyond low Earth orbit since"], ["https://www.tiktok.com/@repmaxwellfrost/video/7274315960302013727", "We need elected officials who actually give a damn about our lives. We have a lot of work to do, but I'm confident our generation will end the rampant gun violence hurting our communities in our lifetime."], ["https://www.tiktok.com/@repmaxwellfrost/video/7267240096603114783", "Seniors have earned Social Security through a lifetime of work; they deserve to retire with dignity."], ["https://www.tiktok.com/@repmaxwellfrost/video/7263528686014467371", "Enough of the egregious fees and profiteering by landlords. It's time for transparency, pro-renter practices, and an end to ridiculous junk fees that make it harder to compare apartments when you shop for a new place."], ["https://www.tiktok.com/@repmaxwellfrost/video/7257326703792459054", "Today I testified in front of the Dept. of Education in support of President Biden’s continued strategy to liberate folks from crushing student loans. We will not stop fighting for swift and effective action to help borrowers!"], ["https://www.tiktok.com/@repmaxwellfrost/video/7254976355169766699", "Our nation, through its armed forces, has effectively developed and created a system capable of ensuring the safety and training of gun users — it's time we take that knowledge and apply it outside of the military to our communities so we can save lives."], ["https://www.tiktok.com/@repmaxwellfrost/video/7250992153592073515", "This June we had folks stop by our office & write notes of queer resiliency, pride, and love for our Florida"], ["https://www.tiktok.com/@repmaxwellfrost/video/7237918302771875118", "🛑 STOP SCROLLING if you have intl. travel coming up, & CHECK your passport. If it's expired, near expiration, or you need to apply for a new one, please do so ASAP! "], ["https://www.tiktok.com/@repmaxwellfrost/video/7237243050827779371", "House Republicans control this chamber, Speaker McCarthy controls the floor."], ["https://www.tiktok.com/@repmaxwellfrost/video/7234567599844003114", "They can pass sham resolutions that try and vilify us, but they cannot take away our stories."], ["https://www.tiktok.com/@repmaxwellfrost/video/7233938644162170155", "For a party full of leadership that advocates for small government and local control, Republican leaders from D.C. to Florida sure are hellbent on stifling local government and democracy when they're losing on the playing field."], ["https://www.tiktok.com/@repmaxwellfrost/video/7232901839526579498", "Ahead of Mother’s Day, I want to share this book from Patricia Padauy-Oliver, who lost her son, Joaquin, in the Parkland shooting."], ["https://www.tiktok.com/@repmaxwellfrost/video/7232008156845755694", "Today, House Republicans plan to pass HR 2, a hateful \"solution\" to our immigration crisis. I'm voting no because the people of Central Florida demand real and comprehensive immigration reform."], ["https://www.tiktok.com/@repmaxwellfrost/video/7226784970235284779", "Fed up, fired up, and together on the frontlines of our democracy."], ["https://www.tiktok.com/@repmaxwellfrost/video/7224860555989830954", "This week, alongside Sen Markey and Rep AOC, we re-introduced the Green New Deal. This is about more than a livable future, but a thrivable planet, where we all have the resources we need to be successful."], ["https://www.tiktok.com/@repmaxwellfrost/video/7224130138022300974", "We want freedom & liberty for our people; they want the government to be in children's pants. Disgusting. History will not look kindly on this. Trans people will continue to fight for equity, we will be right by their side, & we will win."], ["https://www.tiktok.com/@repmaxwellfrost/video/7223962731584458027", "Being able to make a decision about your future and your body – that’s freedom."], ["https://www.tiktok.com/@repmaxwellfrost/video/7223201659139231022", "As long as there's injustice, we will not be silent; we will continue to fight for a world where no one has to fear gun violence."], ["https://www.tiktok.com/@repmaxwellfrost/video/7216730310417943854", "This Trans Day of Visibility we celebrate all of our transgender and non-binary community all across Central Florida and the entire country! 🏳️‍⚧️"], ["https://www.tiktok.com/@repmaxwellfrost/video/7215937535212522795", "For years, FL Dems AND Republicans have joined forces to ban offshore drilling in the Gulf. We've seen the devastating effects oil drilling can have firsthand, pollution that harms our beaches and communities. Will my colleagues across the aisle keep their word, or will they stick their heads in the oil-covered sand?"], ["https://www.tiktok.com/@repmaxwellfrost/video/7215381629148171562", "I rise today furious. Angry for the people we lost in Nashville, for the hundreds that cried not knowing if their loved one would come home from school."], ["https://www.tiktok.com/@repmaxwellfrost/video/7205700755666292010", "As Black History Month has come to a close, I honored some of the most impactful Black leaders Central Florida has ever seen."], ["https://www.tiktok.com/@repmaxwellfrost/video/7205614386914889002", "The President has the right to"]]